# Introduction to Pandas

**Pandas** is a package for data manipulation and analysis in Python. The name Pandas is derived from the econometrics term Panel Data. Pandas incorporates two additional data structures into Python, namely **Pandas Series** and **Pandas DataFrame**. These data structures allow us to work with labeled and relational data in an easy and intuitive manner. These lessons are intended as a basic overview of Pandas and introduces some of its most important features.

In the following lessons you will learn:

    -  How to import Pandas
    -  How to create Pandas Series and DataFrames using various methods
    -  How to access and change elements in Series and DataFrames
    -  How to perform arithmetic operations on Series
    -  How to load data into a DataFrame
    -  How to deal with Not a Number (NaN) values

# Why Use Pandas?

The recent success of machine learning algorithms is partly due to the huge amounts of data that we have available to train our algorithms on. However, when it comes to data, quantity is not the only thing that matters, the quality of your data is just as important. It often happens that large datasets don’t come ready to be fed into your learning algorithms. More often than not, large datasets will often have missing values, outliers, incorrect values, etc… Having data with a lot of missing or bad values, for example, is not going to allow your machine learning algorithms to perform well. Therefore, one very important step in machine learning is to look at your data first and make sure it is well suited for your training algorithm by doing some basic data analysis. This is where Pandas come in. Pandas Series and DataFrames are designed for fast data analysis and manipulation, as well as being flexible and easy to use. Below are just a few features that makes Pandas an excellent package for data analysis:

    -  Allows the use of labels for rows and columns
    -  Can calculate rolling statistics on time series data
    -  Easy handling of NaN values
    -  Is able to load data of different formats into DataFrames
    -  Can join and merge different datasets together
    -  It integrates with NumPy and Matplotlib

For these and other reasons, Pandas DataFrames have become one of the most commonly used Pandas object for data analysis in Python.

# Creating Pandas Series

In [1]:
import pandas as pd #import pandas as alias name pd.

In [2]:
pd.__version__  # To check the version of the pandas. This is the latest version at the time of creating this notebook.

'1.0.3'

In [3]:
# We are gonna create a pandas series that stores a grocery list
groceries = pd.Series(data=[30, 6, 'Yes', 'No'], index=['eggs', 'apples', 'milk', 'bread'])
groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [4]:
groceries.shape # This gives us the shape of the series which is single row array.

(4,)

In [5]:
groceries.ndim # This is a 1 dimensional array.

1

In [6]:
groceries.size # This gives us the number of elements in the series.

4

In [7]:
groceries.index # This gives the index of the series.

Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

In [8]:
groceries.values # This gives the values to the index in the series.

array([30, 6, 'Yes', 'No'], dtype=object)

In [9]:
'bananas' in groceries # To check if the index 'bananas' is present in the groceries array/series.

False

In [11]:
'apples' in groceries # To check if the index 'apples' is present in the groceries array/series.

True

# Accessing and Deleting Elements in Pandas Series

In [18]:
# Accessing values with their index lables
groceries['bread']

'No'

In [19]:
# Accessing multiple values
groceries[['apples', 'eggs']]

apples     6
eggs      30
dtype: object

In [20]:
# Accessing elements using numeric indices
groceries[0]

30

In [21]:
groceries[-1]

'No'

In [22]:
groceries[[1, 2]]

apples      6
milk      Yes
dtype: object

In [23]:
# .loc stands for location and it is used to explicitely state that we are using a labeled index.
groceries.loc[['eggs', 'apples']]

eggs      30
apples     6
dtype: object

In [24]:
# .iloc stands for integer location and it is used to explicitely state that we are using a numerical index.
groceries.iloc[[2, 3]]

milk     Yes
bread     No
dtype: object

In [25]:
groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [26]:
# Changing the values using the index in the list.
groceries['eggs'] = 5
groceries

eggs        5
apples      6
milk      Yes
bread      No
dtype: object

In [30]:
# Delete values fron the panda series using DROP method
groceries.drop('apples') # Becareful with the bracket. Do not use '[]'.

eggs       5
milk     Yes
bread     No
dtype: object

In [31]:
groceries
# The above DROp method just returned a copy of the modified series but did not change the actual series.

eggs        5
apples      6
milk      Yes
bread      No
dtype: object

In [32]:
# To delete the element from the actual series by setting the inplace keyword to True.
groceries.drop('apples', inplace=True)
groceries

eggs       5
milk     Yes
bread     No
dtype: object

# Arithmetic Operations on Pandas Series

In [33]:
# Creating a new panda series with just fruits
fruits = pd.Series([10, 6, 3], ['apples', 'oranges', 'bananas'])
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [34]:
fruits + 2 # Adding the series with 2

apples     12
oranges     8
bananas     5
dtype: int64

In [35]:
fruits - 2 # Subtracting the series with 2

apples     8
oranges    4
bananas    1
dtype: int64

In [36]:
fruits * 2 # Multipling series with 2

apples     20
oranges    12
bananas     6
dtype: int64

In [37]:
fruits / 2 # dividing series with 2

apples     5.0
oranges    3.0
bananas    1.5
dtype: float64

In [38]:
# We can also do arithmetic operations using NumPy library. Hence, we imported the numpy library.
import numpy as np

In [39]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [40]:
np.sqrt(fruits) # Square root to all the values in fruits series

apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64

In [41]:
np.exp(fruits) # Using Exponential to all the values in fruits series

apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

In [42]:
np.power(fruits, 2) # All the values are raised to the power of 2 i.e. square of 2

apples     100
oranges     36
bananas      9
dtype: int64

In [43]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [44]:
fruits['bananas'] + 2 # We can do arithmetic operations to the individual and multiple index values.

5

In [45]:
fruits.iloc[0] - 2

8

In [46]:
fruits[['apples', 'oranges']] * 2

apples     20
oranges    12
dtype: int64

In [47]:
fruits[['apples', 'oranges']] / 2

apples     5.0
oranges    3.0
dtype: float64

In [49]:
# This is a seies with mixed data types which is contrast to the fruits series which has only one datatype.
groceries = pd.Series(data=[30, 6, 'Yes', 'No'], index=['eggs', 'apples', 'milk', 'bread'])
groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [50]:
groceries * 2 # We can also do some but not all arithmetic operations for the series which has mixed data types
              # so using arithmetic operation which is applicable to all the data types is a good practice.

eggs          60
apples        12
milk      YesYes
bread       NoNo
dtype: object

# Quiz: Manipulate a Series

In [51]:
import pandas as pd

In [54]:
# Create a Pandas Series that contains the distance of some planets from the Sun.
# Use the name of the planets as the index to your Pandas Series, and the distance
# from the Sun as your data. The distance from the Sun is in units of 10^6 km

distance_from_sun = [149.6, 1433.5, 227.9, 108.2, 778.6]
planets = ['Earth','Saturn', 'Mars','Venus', 'Jupiter']

In [55]:
# Create a Pandas Series using the above data, with the name of the planets as
# the index and the distance from the Sun as your data.

dist_planets = pd.Series(data=distance_from_sun, index=planets)
dist_planets

Earth       149.6
Saturn     1433.5
Mars        227.9
Venus       108.2
Jupiter     778.6
dtype: float64

In [58]:
# Calculate the number of minutes it takes sunlight to reach each planet. You can
# do this by dividing the distance from the Sun for each planet by the speed of light.
# Since in the data above the distance from the Sun is in units of 10^6 km, you can
# use a value for the speed of light of c = 18, since light travels 18 x 10^6 km/minute.

time_light = dist_planets / 18
time_light

Earth       8.311111
Saturn     79.638889
Mars       12.661111
Venus       6.011111
Jupiter    43.255556
dtype: float64

In [59]:
# Use Boolean indexing to select only those planets for which sunlight takes less
# than 40 minutes to reach them.

close_planets = time_light[time_light < 40]
close_planets

Earth     8.311111
Mars     12.661111
Venus     6.011111
dtype: float64

# Creating Pandas DataFrames

In [60]:
import pandas as pd

In [63]:
# To create dataframes, we have created a dictionary using panda series. 
items = {'Bob': pd.Series([245, 25, 55], index =['bike', 'pants', 'watch']), 
         'Alice': pd.Series([40, 110, 500, 45], index=['book', 'glasses', 'bike', 'pants'])}
type(items)

dict

In [66]:
# We have created a dat frame using the items dictionary and assigned it to shopping_carts variable.
shopping_carts = pd.DataFrame(items) # Always keep D & F in DataFrame capitalized.
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [67]:
# We can create data frame without using the index
data = {'Bob': pd.Series([245, 25, 55]),
       'Alice': pd.Series([40, 110, 500, 45])}
df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [68]:
shopping_carts.index # To access the index of the dataframe

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

In [70]:
shopping_carts.columns # To access the columns of the data frame i.e labels in 1st column

Index(['Bob', 'Alice'], dtype='object')

In [71]:
shopping_carts.values # To access the values of both shopping carts as an array.

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [72]:
shopping_carts.shape

(5, 2)

In [73]:
df.shape

(4, 2)

In [74]:
shopping_carts.ndim

2

In [75]:
df.ndim

2

In [76]:
shopping_carts.size

10

In [77]:
df.size

8

In [79]:
# To access only the bob's shopping cart
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [80]:
# Get only the selected items from both Alice and Bob's shoppingt carts.
sel_shopping_cart = pd.DataFrame(items, index=['pants', 'book'])
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [85]:
# To select specific items from Alice's shopping cart
alice_sel_shopping_cart = pd.DataFrame(items, index=['glasses', 'bike'], columns=['Alice']) # Here careful about columns spelling 's' is important.
alice_sel_shopping_cart

         Alice
glasses    110
bike       500

In [87]:
# We can manually create a data frame with numeric valus too
data = {'Integers': [1, 2, 3],
        'Floats': [4.5, 8.2, 9.6]}
dt = pd.DataFrame(data, index=['label 1', 'label 2', 'label 3']) # We can also give indexes in here.
dt

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

In [42]:
# creating a list of python dictionaries
items = [{'bikes': 20, 'pants': 30, 'watches': 35}, {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5}]

store_items = pd.DataFrame(items, index = ['store 1', 'store 2'])
store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

In [43]:
store_items.shape

(2, 4)

In [44]:
store_items.size

8

# Accessing Elements in Pandas DataFrames

In [45]:
import pandas as pd

In [46]:
store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

In [47]:
# Access column values by using lables
store_items[['bikes']]

         bikes
store 1     20
store 2     15

In [48]:
# Using list of column labels to access multiple columns
store_items[['watches', 'pants']]

         watches  pants
store 1       35     30
store 2       10      5

In [49]:
# Accessing rows using the row index label
store_items.loc[['store 1']]

         bikes  pants  watches  glasses
store 1     20     30       35      NaN

In [50]:
# Access a value at a specific row by column. remember column label comes first then row label
store_items['bikes']['store 2']

15

Modifying dataframes by adding rows and coulmns

In [51]:
store_items['shirts'] = [15, 2]
store_items

         bikes  pants  watches  glasses  shirts
store 1     20     30       35      NaN      15
store 2     15      5       10     50.0       2

In [52]:
# adding columns by doing arithmetic operation on other columns.
store_items['suits'] = store_items['pants'] + store_items['shirts']
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN      15     45
store 2     15      5       10     50.0       2      7

In [53]:
# For adding a row, we need to create a separate dataframe and append it to the present dataframe.
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]
new_store = pd.DataFrame(new_items, index=['store 3'])
new_store

         bikes  pants  watches  glasses
store 3     20     30       35        4

In [54]:
# Now, add the new datframe to the previous using append method
store_items = store_items.append(new_store)
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN    15.0   45.0
store 2     15      5       10     50.0     2.0    7.0
store 3     20     30       35      4.0     NaN    NaN

In [55]:
# Adding a new column by taking the values from the other column
store_items['new watches'] = store_items['watches'][1:]
store_items

         bikes  pants  watches  glasses  shirts  suits  new watches
store 1     20     30       35      NaN    15.0   45.0          NaN
store 2     15      5       10     50.0     2.0    7.0         10.0
store 3     20     30       35      4.0     NaN    NaN         35.0

In [56]:
# Adding a new column before a specific column i.e. adding shoes column before watches column
store_items.insert(2, 'shoes', [8, 5, 0]) # insert(index, label, data[])
store_items

         bikes  pants  shoes  watches  glasses  shirts  suits  new watches
store 1     20     30      8       35      NaN    15.0   45.0          NaN
store 2     15      5      5       10     50.0     2.0    7.0         10.0
store 3     20     30      0       35      4.0     NaN    NaN         35.0

Deleting rows and columns in a datframe using pop() and drop() methods.

In [58]:
# pop() method to delete columns
# drop() method to delete both rows and columns by using 'axis' keyword
store_items.pop('new watches')
store_items

         bikes  pants  shoes  watches  glasses  shirts  suits
store 1     20     30      8       35      NaN    15.0   45.0
store 2     15      5      5       10     50.0     2.0    7.0
store 3     20     30      0       35      4.0     NaN    NaN

In [59]:
store_items = store_items.drop(['watches', 'shoes'], axis=1) # Axis=1 is for deleting the columns.
store_items

         bikes  pants  glasses  shirts  suits
store 1     20     30      NaN    15.0   45.0
store 2     15      5     50.0     2.0    7.0
store 3     20     30      4.0     NaN    NaN

In [60]:
store_items = store_items.drop(['store 1', 'store 2'], axis=0) # Axis=0 is for deleting the rows
store_items

         bikes  pants  glasses  shirts  suits
store 3     20     30      4.0     NaN    NaN

Modifying the labels in a datframe

In [61]:
store_items = store_items.rename(columns={'bikes': 'hats'}) # Changng the column label of 'bikes' to 'hats'.
store_items

         hats  pants  glasses  shirts  suits
store 3    20     30      4.0     NaN    NaN

In [64]:
store_items = store_items.rename(index={'store 3': 'store'})
store_items

       hats  pants  glasses  shirts  suits
store    20     30      4.0     NaN    NaN

# Dealing with NaN values

In [65]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])

# We display the DataFrame
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [66]:
# To calculate the number of NaN values in our data frame
x = store_items.isnull().sum().sum()
print(x)
# Let's break it down.

3

the .isnull() method returns a Boolean DataFrame of the same size as store_items and indicates with True the elements that have NaN values and with False the elements that are not.

In [67]:
x = store_items.isnull() # All the positions that say 'True' are NaN values.
print(x)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1  False  False    False   False  False  False     True
store 2  False  False    False   False  False  False    False
store 3  False  False    False    True  False   True    False

In [ ]:
# Here, True = 1 and False = 0 are assigned
x = store_items.isnull().sum() 
print(x)

In [69]:
x = store_items.isnull().sum().sum() # Total NaN values
print(x)

3

In [70]:
# We can also count the non-NaN values using count() method
store_items.count()

bikes      3
pants      3
watches    3
shirts     2
shoes      3
suits      2
glasses    2
dtype: int64

Now that we learned how to know if our dataset has any NaN values in it, the next step is to decide what to do with them. In general we have two options, we can either delete or replace the NaN values.

We will start by learning how to eliminate rows or columns from our DataFrame that contain any NaN values. The .dropna(axis) method eliminates any rows with NaN values when axis = 0 is used and will eliminate any columns with NaN values when axis = 1 is used.

In [71]:
store_items.dropna(axis=0) # This drops any rows with NaN values.

         bikes  pants  watches  shirts  shoes  suits  glasses
store 2     15      5       10     2.0      5    7.0     50.0

In [72]:
store_items.dropna(axis=1) # This drops any columns with NaN values.

         bikes  pants  watches  shoes
store 1     20     30       35      8
store 2     15      5       10      5
store 3     20     30       35     10

Notice that the .dropna() method eliminates (drops) the rows or columns with NaN values out of place. This means that the original DataFrame is not modified. You can always remove the desired rows or columns in place by setting the keyword inplace = True inside the dropna() function.

Now, instead of eliminating NaN values, we can replace them with suitable values. We could choose for example to replace all NaN values with the value 0. We can do this by using the .fillna() method.

In [74]:
store_items.fillna(0) # Fills NaN values with value 0.

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      0.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     0.0     10    0.0      4.0

In [76]:
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

We can also use the .fillna() method to replace NaN values with previous values in the DataFrame, this is known as forward filling. When replacing NaN values with forward filling, we can use previous values taken from columns or rows. The .fillna(method = 'ffill', axis) will use the forward filling (ffill) method to replace NaN values using the previous known value along the given axis.

In [77]:
store_items.fillna(method='ffill', axis=0) # Here store 3 NaN values are filled with previous column values but not in store 1.

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

Notice that the two NaN values in store 3 have been replaced with previous values in their columns. However, notice that the NaN value in store 1 didn't get replaced. That's because there are no previous values in this column, since the NaN value is the first value in that column. However, if we do forward fill using the previous row values, this won't happen.

In [78]:
# We replace NaN values with the previous value in the row
store_items.fillna(method = 'ffill', axis = 1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    35.0   10.0   10.0      4.0

Similarly, you can choose to replace the NaN values with the values that go after them in the DataFrame, this is known as backward filling. The .fillna(method = 'backfill', axis) will use the backward filling (backfill) method to replace NaN values using the next known value along the given axis. Just like with forward filling we can choose to use row or column values.

In [79]:
# We replace NaN values with the next value in the column
store_items.fillna(method = 'backfill', axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0     50.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

Notice that the NaN value in store 1 has been replaced with the next value in its column. However, notice that the two NaN values in store 3 didn't get replaced. That's because there are no next values in these columns, since these NaN values are the last values in those columns. However, if we do backward fill using the next row values, this won't happen.

In [80]:
# We replace NaN values with the next value in the row
store_items.fillna(method = 'backfill', axis = 1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0      NaN
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    10.0   10.0    4.0      4.0

Notice that the .fillna() method replaces (fills) the NaN values out of place. This means that the original DataFrame is not modified. You can always replace the NaN values in place by setting the keyword inplace = True inside the fillna() function.

We can also choose to replace NaN values by using different interpolation methods. For example, the .interpolate(method = 'linear', axis) method will use linear interpolation to replace NaN values using the values along the given axis.

In [81]:
# We replace NaN values by using linear interpolation using column values
store_items.interpolate(method = 'linear', axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

Notice that the two NaN values in store 3 have been replaced with linear interpolated values. However, notice that the NaN value in store 1 didn't get replaced. That's because the NaN value is the first value in that column, and since there is no data before it, the interpolation function can't calculate a value. Now, let's interpolate using row values instead:

In [82]:
# We replace NaN values by using linear interpolation using row values
store_items.interpolate(method = 'linear', axis = 1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    22.5   10.0    7.0      4.0

Just as with the other methods we saw, the .interpolate() method replaces NaN values out of place.

# QUIZ: Manipulate a DataFrame

In [83]:
import pandas as pd
import numpy as np

In [84]:
# Since we will be working with ratings, we will set the precision of our 
# dataframes to one decimal place.
pd.set_option('precision', 1)

In [85]:
# Create a Pandas DataFrame that contains the ratings some users have given to a
# series of books. The ratings given are in the range from 1 to 5, with 5 being
# the best score. The names of the books, the authors, and the ratings of each user
# are given below:

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

In [86]:
# Users that have np.nan values means that the user has not yet rated that book.
# Use the data above to create a Pandas DataFrame that has the following column
# labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'. Let Pandas
# automatically assign numerical row indices to the DataFrame. 

# Create a dictionary with the data given above
dat = {'Author': authors,
       'Book Title': books,
       'User 1': user_1,
       'User 2': user_2,
       'User 3': user_3,
       'User 4': user_4
      }

In [88]:
# Use the dictionary to create a Pandas DataFrame
book_ratings = pd.DataFrame(dat)
book_ratings

                Author           Book Title  User 1  User 2  User 3  User 4
0      Charles Dickens   Great Expectations     3.2     5.0     2.0     4.0
1       John Steinbeck      Of Mice and Men     NaN     1.3     2.3     3.5
2  William Shakespeare     Romeo and Juliet     2.5     4.0     NaN     4.0
3          H. G. Wells     The Time Machine     NaN     3.8     4.0     5.0
4        Lewis Carroll  Alice in Wonderland     NaN     NaN     NaN     4.2

In [90]:
# If you created the dictionary correctly you should have a Pandas DataFrame
# that has column labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3',
# 'User 4' and row indices 0 through 4.
x = book_ratings.mean()
print(x)
# Now replace all the NaN values in your DataFrame with the average rating in
# each column. Replace the NaN values in place. HINT: you can use the fillna()
# function with the keyword inplace = True, to do this. Write your code below:\

book_ratings.fillna(book_ratings.mean(), inplace = True)
book_ratings

User 1    2.9
User 2    3.5
User 3    2.8
User 4    4.1
dtype: float64

                Author           Book Title  User 1  User 2  User 3  User 4
0      Charles Dickens   Great Expectations     3.2     5.0     2.0     4.0
1       John Steinbeck      Of Mice and Men     2.9     1.3     2.3     3.5
2  William Shakespeare     Romeo and Juliet     2.5     4.0     2.8     4.0
3          H. G. Wells     The Time Machine     2.9     3.8     4.0     5.0
4        Lewis Carroll  Alice in Wonderland     2.9     3.5     2.8     4.2

From the DataFrame above you can now pick all the books that had a rating of 5. You can do this in just one line of code. Try to do it yourself first, you'll find the answer below:

In [93]:
best_rated = book_ratings[(book_ratings == 5).any(axis = 1)]['Book Title'].values
print(best_rated)

['Great Expectations' 'The Time Machine']

# Loading Data into a Pandas DataFrame

In machine learning you will most likely use databases from many sources to train your learning algorithms. Pandas allows us to load databases of different formats into DataFrames. One of the most popular data formats used to store databases is csv. CSV stands for Comma Separated Values and offers a simple format to store data. We can load CSV files into Pandas DataFrames using the pd.read_csv() function. Let's load Google stock data into a Pandas DataFrame. The GOOG.csv file contains Google stock data from 8/19/2004 till 10/13/2017 taken from Yahoo Finance.

In [94]:
# We load Google stock data in a DataFrame
Google_stock = pd.read_csv('./Statistics_from_stock_data/GOOG.csv')

# We print some information about Google_stock
print('Google_stock is of type:', type(Google_stock))
print('Google_stock has shape:', Google_stock.shape)

Google_stock is of type: <class 'pandas.core.frame.DataFrame'>
Google_stock has shape: (3313, 7)

We see that it is quite a large dataset and that Pandas has automatically assigned numerical row indices to the DataFrame. Pandas also used the labels that appear in the data in the CSV file to assign the column labels.

When dealing with large datasets like this one, it is often useful just to take a look at the first few rows of data instead of the whole dataset. We can take a look at the first 5 rows of data using the .head() method

In [95]:
Google_stock.head() #Shows the first 5 rows of the dataframe.

         Date  Open  High   Low  Close  Adj Close    Volume
0  2004-08-19  49.7  51.7  47.7   49.8       49.8  44994500
1  2004-08-20  50.2  54.2  49.9   53.8       53.8  23005800
2  2004-08-23  55.0  56.4  54.2   54.3       54.3  18393200
3  2004-08-24  55.3  55.4  51.5   52.1       52.1  15361800
4  2004-08-25  52.1  53.7  51.6   52.7       52.7   9257400

In [96]:
Google_stock.tail() #Shows the last 5 rows of the dataframe.

            Date   Open   High    Low  Close  Adj Close   Volume
3308  2017-10-09  980.0  985.4  976.1  977.0      977.0   891400
3309  2017-10-10  980.0  981.6  966.1  972.6      972.6   968400
3310  2017-10-11  973.7  990.7  972.2  989.2      989.2  1693300
3311  2017-10-12  987.5  994.1  985.0  987.8      987.8  1262400
3312  2017-10-13  992.0  997.2  989.0  989.7      989.7  1157700

We can also optionally use .head(N) or .tail(N) to display the first and last N rows of data, respectively.

In [97]:
Google_stock.head(20) # Shows the first 20 rows in the dataframe from 0 to 19

          Date  Open  High   Low  Close  Adj Close    Volume
0   2004-08-19  49.7  51.7  47.7   49.8       49.8  44994500
1   2004-08-20  50.2  54.2  49.9   53.8       53.8  23005800
2   2004-08-23  55.0  56.4  54.2   54.3       54.3  18393200
3   2004-08-24  55.3  55.4  51.5   52.1       52.1  15361800
4   2004-08-25  52.1  53.7  51.6   52.7       52.7   9257400
5   2004-08-26  52.1  53.6  52.0   53.6       53.6   7148200
6   2004-08-27  53.7  54.0  52.5   52.7       52.7   6258300
7   2004-08-30  52.3  52.4  50.7   50.7       50.7   5235700
8   2004-08-31  50.8  51.5  50.7   50.9       50.9   4954800
9   2004-09-01  51.0  51.2  49.5   49.8       49.8   9206800
10  2004-09-02  49.3  50.9  49.2   50.4       50.4  15232100
11  2004-09-03  50.1  50.5  49.3   49.7       49.7   5191000
12  2004-09-07  50.2  50.7  49.5   50.5       50.5   5891300
13  2004-09-08  50.0  51.2  49.9   50.8       50.8   5023000
14  2004-09-09  50.9  51.0  50.2   50.8       50.8   4092100
15  2004-09-10  50.5  52.9  50.3   52.3       52.3   8764200
16  2004-09-13  53.0  53.9  52.9   53.4       53.4   7902900
17  2004-09-14  53.4  55.6  53.0   55.4       55.4  10910200
18  2004-09-15  54.9  56.7  54.7   55.6       55.6  10793500
19  2004-09-16  55.8  57.5  55.5   56.6       56.6   9335800

Let's do a quick check to see whether we have any NaN values in our dataset. To do this, we will use the .isnull() method followed by the .any() method to check whether any of the columns contain NaN values.

In [98]:
Google_stock.isnull().any() # No data is missing i.e. no NaN values.

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

When dealing with large datasets, it is often useful to get statistical information from them. Pandas provides the .describe() method to get descriptive statistics on each column of the DataFrame.

In [100]:
Google_stock.describe()

         Open    High     Low   Close  Adj Close   Volume
count  3313.0  3313.0  3313.0  3313.0     3313.0  3.3e+03
mean    380.2   383.5   376.5   380.1      380.1  8.0e+06
std     223.8   225.0   222.5   223.9      223.9  8.4e+06
min      49.3    50.5    47.7    49.7       49.7  7.9e+03
25%     226.6   228.4   224.0   226.4      226.4  2.6e+06
50%     293.3   295.4   289.9   293.0      293.0  5.3e+06
75%     536.7   540.0   532.4   536.7      536.7  1.1e+07
max     992.0   997.2   989.0   989.7      989.7  8.3e+07

If desired, we can apply the .describe() method on a single column as shown below:

In [101]:
Google_stock['Adj Close'].describe()

count    3313.0
mean      380.1
std       223.9
min        49.7
25%       226.4
50%       293.0
75%       536.7
max       989.7
Name: Adj Close, dtype: float64

Similarly, you can also look at one statistic by using one of the many statistical functions Pandas provides.

In [102]:
# We print information about our DataFrame  
print()
print('Maximum values of each column:\n', Google_stock.max())
print()
print('Minimum Close value:', Google_stock['Close'].min())
print()
print('Average value of each column:\n', Google_stock.mean())

Maximum values of each column:
 Date         2017-10-13
Open              1e+03
High              1e+03
Low               1e+03
Close             1e+03
Adj Close         1e+03
Volume         82768100
dtype: object

Minimum Close value: 49.681866

Average value of each column:
 Open         3.8e+02
High         3.8e+02
Low          3.8e+02
Close        3.8e+02
Adj Close    3.8e+02
Volume       8.0e+06
dtype: float64

Another important statistical measure is data correlation. Data correlation can tell us, for example, if the data in different columns are correlated. We can use the .corr() method to get the correlation between different columns, as shown below:

In [103]:
# We display the correlation between columns
Google_stock.corr()

           Open  High  Low  Close  Adj Close  Volume
Open        1.0   1.0  1.0    1.0        1.0    -0.6
High        1.0   1.0  1.0    1.0        1.0    -0.6
Low         1.0   1.0  1.0    1.0        1.0    -0.6
Close       1.0   1.0  1.0    1.0        1.0    -0.6
Adj Close   1.0   1.0  1.0    1.0        1.0    -0.6
Volume     -0.6  -0.6 -0.6   -0.6       -0.6     1.0

A correlation value of 1 tells us there is a high correlation and a correlation of 0 tells us that the data is not correlated at all.

We will end this Introduction to Pandas by taking a look at the .groupby() method. The .groupby() method allows us to group data in different ways. Let's see how we can group data to get different types of information. For the next examples we are going to load fake data about a fictitious company.

In [131]:
# We load fake Company data in a DataFrame
data = pd.read_csv('./Statistics_from_stock_data/fake_company.csv')

data

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991    Alice         HR   26   52000
4  1991      Bob         RD   31   50000
5  1991  Charlie      Admin   46   60000
6  1992    Alice         HR   27   60000
7  1992      Bob         RD   32   52000
8  1992  Charlie      Admin   47   62000

We see that the data contains information for the year 1990 through 1992. For each year we see name of the employees, the department they work for, their age, and their annual salary. Now, let's use the .groupby() method to get information.

Let's calculate how much money the company spent in salaries each year. To do this, we will group the data by Year using the .groupby() method and then we will add up the salaries of all the employees by using the .sum() method.

In [133]:
# We display the total amount of money spent in salaries each year
data.groupby(['Year'])['Salary'].sum()

Year
1990    153000
1991    162000
1992    174000
Name: Salary, dtype: int64

In [134]:
# We display the average salary per year
data.groupby(['Year'])['Salary'].mean()

Year
1990    51000
1991    54000
1992    58000
Name: Salary, dtype: int64

In [135]:
# We display the total salary each employee received in all the years they worked for the company
data.groupby(['Name'])['Salary'].sum()

Name
Alice      162000
Bob        150000
Charlie    177000
Name: Salary, dtype: int64

In [136]:
# We display the salary distribution per department per year.
data.groupby(['Year', 'Department'])['Salary'].sum()

Year  Department
1990  Admin         55000
      HR            50000
      RD            48000
1991  Admin         60000
      HR            52000
      RD            50000
1992  Admin         62000
      HR            60000
      RD            52000
Name: Salary, dtype: int64

# End of Pandas Library